app/controllers/artists_controller.rb

  def index
    if params[:artist_id]
     @artists = Song.find(params[:songs_id]).artist
   else
     @artists = Artist.all
---
SELECT "artists".* FROM "artists"