app/controllers/songs_controller.rb

SELECT "artists".* FROM "artists"
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 5]]
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 5]]
SELECT "songs".* FROM "songs"
---
  def index
    if params[:artist_id]
      if Artist.exists?(params[:artist_id]) == true
        # binding.pry
        @artist = Artist.find(params[:artist_id])
        @songs = Artist.find(params[:artist_id]).songs
      else
        flash[:alert] = "Artist not found"
        redirect_to artists_path
      end
    else
      @songs = Song.all

SELECT  "songs".* FROM "songs" WHERE (1) LIMIT 1
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 5]]
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 7]]
---
  def show
    # binding.pry
    if Song.exists?(params[:id]) == false
      @artist = Artist.find(params[:artist_id])
      flash[:alert] = "Song not found."
      redirect_to artist_songs_path(@artist)
    else
      @song = Song.find(params[:id])