app/controllers/songs_controller.rb

  def index
    if params[:artist_id]
      if Artist.where(id: params[:artist_id]).empty?
---
SELECT COUNT(*) FROM "artists" WHERE "artists"."id" = ?  [["id", 0]]